In [1]:
from pathlib import Path
import pandas as pd

In [2]:
home_dir = Path.home()
inside_airbnb_data_dir = home_dir / 'Programming/data/inside-airbnb/london'
mps_recorded_crime_geographic_data_dir = home_dir / 'Programming/data/london-datastore/mps-recorded-crime-geographic-data'
population_dataset_england_wales_data_dir = home_dir / 'Programming/data/office-national-statistics/population-dataset-england-wales/'

In [3]:
inside_airbnb_data_file = inside_airbnb_data_dir / 'listings.csv'
mps_recorded_crime_geographic_data_file =  mps_recorded_crime_geographic_data_dir / 'MPS Borough Level Crime (most recent 24 months).csv'
population_dataset_england_wales_data_file = population_dataset_england_wales_data_dir / 'mye23tablesew.xlsx'

In [4]:
column_list = ['BoroughName', '202401', '202402', '202403', '202404', '202405',
               '202406', '202407', '202408', '202409', '202410', '202411', '202412']
mps_monthly_crime_df = pd.read_csv(mps_recorded_crime_geographic_data_file, usecols = column_list)
crime_df = mps_monthly_crime_df.groupby('BoroughName').sum()

In [5]:
crime_data_summed_groups = {f'Q{int(i)+1}': crime_df.iloc[:, i*3:(i+1)*3].sum(axis=1) for i in range(len(crime_df.columns) // 3)}
crime_data_summed_df = pd.DataFrame(crime_data_summed_groups)
crime_data_summed_df.drop('London Heathrow and London City Airports', inplace=True)

In [9]:
population_df = pd.read_excel(population_dataset_england_wales_data_file, sheet_name='MYE2 - Persons', header=7)
london_population_df = population_df.loc[population_df['Geography'] == 'London Borough'][['Name', 'All ages']]
grouped_population_df = london_population_df.groupby('Name').sum()

In [18]:
crime_data_summed_df.rename(index={'Unknown': 'City of London'}, inplace=True)

In [22]:
crime_data_summed_df.sort_index(ascending=True, inplace=True)

In [26]:
crime_data_summed_df.index.name = 'Name'

In [28]:
crime_data_summed_df.head()

                        Q1    Q2    Q3    Q4
Name
Barking and Dagenham  5068  4873  4930  5220
Barnet                6946  6976  7096  7127
Bexley                4186  4227  4209  3995
Brent                 7884  8316  8216  7947
Bromley               5837  5884  6268  6093

In [38]:
grouped_population_df.head()

                      All ages
Name
Barking and Dagenham    222308
Barnet                  395007
Bexley                  250853
Brent                   344521
Bromley                 331162

In [37]:
crime_data_summed_df.div(grouped_population_df.values/1000)

                                Q1          Q2          Q3          Q4
Name
Barking and Dagenham     22.797200   21.920039   22.176440   23.480936
Barnet                   17.584499   17.660447   17.964239   18.042718
Bexley                   16.687064   16.850506   16.778751   15.925662
Brent                    22.883946   24.137861   23.847603   23.066809
Bromley                  17.625815   17.767739   18.927292   18.398850
Camden                   46.803348   48.070873   47.686088   51.212523
City of London          336.651315  360.273362  376.169960   86.094191
Croydon                  21.639710   21.428518   22.856583   22.426655
Ealing                   20.714552   20.584004   20.703895   21.220760
Enfield                  20.996918   22.209395   22.954595   23.400493
Greenwich                22.504956   23.504571   24.147182   23.953378
Hackney                  31.065549   32.501272   32.129048   32.288573
Hammersmith and Fulham   28.714765   27.801650   29.101495   29.391543
Haringey                 25.455030   27.067841   27.927500   26.721695
Harrow                   14.955513   14.678419   16.094258   16.838238
Havering                 19.258237   19.302989   19.045666   18.083500
Hillingdon               19.607044   22.227586   23.751011   22.954818
Hounslow                 21.815587   21.937330   23.266352   22.715129
Islington                31.035796   35.356146   35.768687   35.578283
Kensington and Chelsea   37.996745   37.928930   41.007731   39.129255
Kingston upon Thames     15.939784   16.238985   17.529656   15.775517
Lambeth                  28.317485   31.386797   32.036135   29.410274
Lewisham                 24.010070   25.744205   26.109110   24.713098
Merton                   15.500490   15.797862   17.215023   15.811801
Newham                   26.338291   28.048390   28.172510   28.782078
Redbridge                19.001761   19.308087   18.886889   18.969852
Richmond upon Thames     14.249692   15.881297   16.009166   15.922215
Southwark                29.072734   30.391197   32.270640   33.842653
Sutton                   15.441236   15.114412   15.910157   15.370187
Tower Hamlets            26.175653   27.258951   30.201506   27.353283
Waltham Forest           20.958040   23.382129   22.842235   23.501703
Wandsworth               19.538038   19.242373   20.219878   18.967827
Westminster             110.761768  101.362596   95.830891  122.888969

In [14]:
columns_list = ['neighbourhood_cleansed', 'bathrooms', 'bedrooms', 'latitude', 'longitude',
                'room_type', 'latitude', 'longitude', 'property_type', 'price']
inside_airbnb_df = pd.read_csv(inside_airbnb_data_file, usecols=columns_list)
inside_airbnb_df.head()

,neighbourhood_cleansed,latitude,longitude,property_type,room_type,bathrooms,bedrooms,price
0,Hammersmith and Fulham,51.49392,-0.22754,Entire rental unit,Entire home/apt,1.5,1.0,$89.00
1,Tower Hamlets,51.52435,-0.06938,Entire condo,Entire home/apt,3.0,3.0,$220.00
2,Hammersmith and Fulham,51.49547,-0.22864,Entire rental unit,Entire home/apt,1.0,1.0,$88.00
3,Hammersmith and Fulham,51.49368,-0.22774,Room in aparthotel,Private room,1.0,1.0,$75.00
4,Haringey,51.59031,-0.09408,Private room in rental unit,Private room,1.0,1.0,$53.00

In [15]:
inside_airbnb_df.columns

Index(['neighbourhood_cleansed', 'latitude', 'longitude', 'property_type',
       'room_type', 'bathrooms', 'bedrooms', 'price'],
      dtype='object')